// Написать программу копирования массива.

int[] array = { 1, 4, 8, 2, 3, 4, 5, 6 };
int n = array.Clone();

Console.Write(n);

